package com.artmakdeveloper.whattoweartoday.DataForTest;

public class TestData implements ITestData {

    @Override
    public String getWearData() {
        String tmp ="{\n" +
                "    \"HeadItem\":[\n" +
                "        {\"t_min\":\"-50\", \"t_max\":\"-41\",  \"text\":\"Шапка на меху, Шарф, Маска\"},\n" +
                "        {\"t_min\":\"-40\", \"t_max\":\"-21\",  \"text\":\"Шапка на меху, Шарф\"},\n" +
                "        {\"t_min\":\"-20\", \"t_max\":\"9\",    \"text\":\"Шапка, Шарф\"},\n" +
                "        {\"t_min\":\"10\",  \"t_max\":\"19\",   \"text\":\"Легкий Шарф\"},\n" +
                "        {\"t_min\":\"20\",  \"t_max\":\"29\",   \"text\":\"\"},\n" +
                "        {\"t_min\":\"30\",  \"t_max\":\"50\",   \"text\":\"Кепка\"}\n" +
                "    ],\n" +
                "\n" +
                "    \"BodyItem\":[\n" +
                "        {\"t_min\":\"-50\", \"t_max\":\"41\",   \"text\":\"Термо белье, Кофта, Жилетка, Дубленка\"},\n" +
                "        {\"t_min\":\"-40\", \"t_max\":\"-31\",  \"text\":\"Термо белье, Кофта, Шуба\"},\n" +
                "        {\"t_min\":\"-30\", \"t_max\":\"-21\",  \"text\":\"Термо белье, Кофта, Пуховик\"},\n" +
                "        {\"t_min\":\"-20\", \"t_max\":\"-11\",  \"text\":\"Майка, Кофта, Пуховик\"},\n" +
                "        {\"t_min\":\"-10\", \"t_max\":\"-1\",   \"text\":\"Майка, Кофта, Пальто\"},\n" +
                "        {\"t_min\":\"0\",   \"t_max\":\"9\",    \"text\":\"Кофта, Куртка\"},\n" +
                "        {\"t_min\":\"10\",  \"t_max\":\"19\",   \"text\":\"Кофта, Жилетка\"},\n" +
                "        {\"t_min\":\"20\",  \"t_max\":\"29\",   \"text\":\"Блузка\"},\n" +
                "        {\"t_min\":\"30\",  \"t_max\":\"50\",   \"text\":\"Майка\"}\n" +
                "\n" +
                "    ],\n" +
                "\n" +
                "    \"LegsItem\":[\n" +
                "        {\"t_min\":\"-50\", \"t_max\":\"-31\",  \"text\":\"Колготки, Ватные штаны\"},\n" +
                "        {\"t_min\":\"-30\", \"t_max\":\"-21\",  \"text\":\"Колготки, Штаны с начесом\"},\n" +
                "        {\"t_min\":\"-20\", \"t_max\":\"-11\",  \"text\":\"Колготки, Штаны\"},\n" +
                "        {\"t_min\":\"-10\", \"t_max\":\"-1\",   \"text\":\"Штаны с начесом\"},\n" +
                "        {\"t_min\":\"0\",   \"t_max\":\"9\",    \"text\":\"Джинсы\"},\n" +
                "        {\"t_min\":\"10\",  \"t_max\":\"29\",   \"text\":\"Колготки, Юбка\"},\n" +
                "        {\"t_min\":\"30\",  \"t_max\":\"50\",   \"text\":\"Шорты\"}\n" +
                "    ],\n" +
                "\n" +
                "    \"ShoesItem\":[\n" +
                "        {\"t_min\":\"-50\", \"t_max\":\"-41\",  \"text\":\"Шерстяные носки, Валянки\"},\n" +
                "        {\"t_min\":\"-40\", \"t_max\":\"-31\",  \"text\":\"Носки, Валянки\"},\n" +
                "        {\"t_min\":\"-30\", \"t_max\":\"-1\",   \"text\":\"Сапоги\"},\n" +
                "        {\"t_min\":\"0\",   \"t_max\":\"9\",    \"text\":\"Ботинки\"},\n" +
                "        {\"t_min\":\"10\",  \"t_max\":\"19\",   \"text\":\"Кросовки\"},\n" +
                "        {\"t_min\":\"20\",  \"t_max\":\"29\",   \"text\":\"Туфли\"},\n" +
                "        {\"t_min\":\"30\",  \"t_max\":\"50\",   \"text\":\"Шлепки\"}\n" +
                "    ],\n" +
                "    \"WomanIcon\":[\n" +
                "        {\"t_min\":\"-50\", \"t_max\":\"41\",   \"text\":\"w_m50_m40\"},\n" +
                "        {\"t_min\":\"-40\", \"t_max\":\"-31\",  \"text\":\"w_m40_m30\"},\n" +
                "        {\"t_min\":\"-30\", \"t_max\":\"-21\",  \"text\":\"w_m30_m20\"},\n" +
                "        {\"t_min\":\"-20\", \"t_max\":\"-11\",  \"text\":\"w_m20_m10\"},\n" +
                "        {\"t_min\":\"-10\", \"t_max\":\"-1\",   \"text\":\"w_m10_0\"},\n" +
                "        {\"t_min\":\"0\",   \"t_max\":\"9\",    \"text\":\"w_p0_p10\"},\n" +
                "        {\"t_min\":\"10\",  \"t_max\":\"19\",   \"text\":\"w_p10_p20\"},\n" +
                "        {\"t_min\":\"20\",  \"t_max\":\"29\",   \"text\":\"w_p20_p30\"},\n" +
                "        {\"t_min\":\"30\",  \"t_max\":\"39\",   \"text\":\"w_p30_p40\"},\n" +
                "        {\"t_min\":\"40\",  \"t_max\":\"50\",   \"text\":\"w_p40_p50\"}\n" +
                "    ]\n" +
                "\n" +
                "}";
        return tmp;
    }
}
